#2) შექმენით 2 ცვლადი, ერთში შეინახეთ სთრინგ რიცხვი, მეორეში integer-ი . თქვენი დავალებაა მათ შორის მოახდინოთ ყველა მათემატიკური ოპერაცია(+, -, *, /)
string="6"
integer=3

print(int(string)+integer)
print(int(string)-integer)
print(int(string)*integer)
print(int(string)/integer)

#2)  მომხმარებელს შემოატანინეთ სიმაღლე, გადააქციეთ float-ად და დაბეჭდეთ მისი მონაცემთა ტიპი
height=(float)(input("plase enter you hight: "))

print(type(height))

#3) კომენტარებით ახსენით რა არის Data Convertion.
#არის პროცესი რომლის დროსაც ერთი ფორმატიდან გადადის მეორეში მაგალითდ როცა STRING დან გადადის INTEGER ში

#4) კომენტარებით ახსენით რა არის implicitly  და explicitly. ჩამოწერეთ ყველა ფუნქცია, რომელიც ცვლის მონაცემთა ტიპს და აღწერეთ
#implycitly ნიშნავს რაიმეს მითითების გარეშე როცა მაგალითდ მონაცემი იცვლება ავტომატურად ხოლო explictly ნიშნავს მითითებით გაკეთებას 
#როცა მიუთითებ როგორი ტიპის უნდა იყოს მაგალითდ.
#1 მონაცემთა ტიპს ცვლის int(integer) გარდაქმნის მას მთელ რიცხვად
#2 str(string) გარდაქმნის მას ტექსტად
#3 float გარდაქმნის მას ათწილადად
 
#5) აუცილებლად უყურეთ დღევანდელ ჩანაწერს
