#1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს
cars=["BMW", "porshe", "TOYOTA supra", "lamborghini", "Honda" ]  #not a chance for mercedes

#2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს
number=[0, 2, 4, 6, 8, 10]

#3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი
name=["nika", "vano", "bacho", "zvio", "levani"]
print(name[3])
#4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით და დაბეჭდეთ მთლიანი სია.
name[3]="dato"
print(name)
#5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ პირველი და ბოლო ელემენტთა ჯამი
num=[1, 2, 3]
num1=num[0]+num[2]
print(num1)