#2) შექმენით რიცხვების სია. გადაუარეთ მას for ციკლითი. შეამოწმეთ თუ რიცხვი ლუწია დაბეჭდეთ "Number is even", სხვა შემთხვევაში "Number is Odd"
number=[1,2,3,4,5,6,7,8,9,10]
for i in number:
    if i % 2 == 0:
        print(number,"is even")
    else:
        print(number,"is odd")

#3) შექმენით სიტყვების სია 10 ელემენტისგან. გადაუარეთ for ციკლით ამ სიას ისე, რომ დაბეჭდოთ ყოველი მე-2 ელემენტი(დაგჭირდებათ slicing-ი)
num1=["ერთი","ორი","სამი","ოთხი","ხუთი","ექვსი","შვიდი","რვა","ცხრა","ათი"]
for i in num1[1::2]:
    print(num1)
#4) შექმენით ცვლადი, სადაც შეინახავთ სიტყვას. გადაუარეთ მას for ციკლით, დაბეჭდეთ მისი თითოეული სიმბოლო და გვერდით მიუწერეთ მისი რიგის ნომერი string-ში(ანუ მერამდენე სიმბოლოა)

#მაგალითად: academy = "GOA"
#"G-1"
#"O-2"
#"A-3"

name="dato"
num=1
for i in name:
    print(i, "-", num)
    num=num+1
#გატესტეთ ეს დავალება სხვადასხვა სიტყვებზე და ნახეთ შედეგი

#5) მოიძიეთ, როგორ შეიძლება სიის შემოტრიალება, შემდეგ შექმენით სია და დაბეჭდეთ ის შემოტრიალებულად. მაგალითად: [1,2] -> [2,1]
sia=[1,2,3,4,5]
print(sia)
reverse=sia[::-1]
print(reverse)

#6) მოიძიეთ, რა არის len ფუნქცია და როგორ მუშაობს ის. გააკეთეთ 2 მაგალითი.

#len არის გასაგები საშუალება და len-ით დავითვლით რამდენი ელემენტია სიაში ან რამდენი სიმბოლო

sia1=[1,2,45,6,7]
print(len(sia1))

sia2="magaliti"
print(len(sia2))

#7) შექმენით 5 ელემენტიანი სია. გამოიყენეთ for ციკლი, range და len ფუნქციები, რომ შეცვალოთ ამ სიაში არსებული ყოველი მეორე ელემენტი თქვენი სახელით. შემდეგ დაბეჭდეთ ეს სია.
sia3=["nika","luka","deme","elene","nino"]
for  i in range(1, 5, 2):
    sia3[i] ="Dato"
print(sia3)
#გაიმეორეთ ყველა განვლილი მასალა. განსაკუთრებული ყურადღება მიაქციეთ: if/elif/else-ს, for/while ციკლებს, სიებს, სთრინგებს, შედარების და ლოგიკურ ოპერატორებს.