#2) გადაიმეორეთ შემდეგი ტერმინები:
#დეკლარაცია - ცვლადის შექმნა
#ინიციალიზება - ცვლადისთვის მნიშვნელობის მინიჭება
#რეინიციალიზება - ცვლადისთვის მნიშვნელობის ხელახლა მინიჭება

#name = "Nika" # აქ ხდება დეკლარაცია, ანუ ცვლადის შექმნა
# = "Nika" - ეს ნაწილი არის ინიციალიზება(მნიშვნელობის მინიჭება)
#name = "Luka" # რეინიციალიზება - ცვლადისთვის მნიშვნელობის ხელახლა მინიჭება```

#3) თქვენი სიტყვებით ახსენით რა არის debugging და რამდენი ნაწილისგან შედგება, ასევე ამ საკითხზე გააკეთეთ ნახაზი paint-ში
#debuging არის კოიდის eror ის შესწორება, ის შედგება 3 ნაწილისგან: კოდის შექმნა, მისი ნახვა EROR ის ნახვა და ტერმინალში გაშევბა და მისი შესწორება.
name=("dato")   #გასწორება  იყო name="dato)  შევასწორე ("dato")თი
print(name)
#მოკლედ დავწერე გავუშვი კოდი ვნახე შეცდომა და გამოვასწორე ზუსტად ეს არის debuging


#4) შექმენით ერთი ცვლადი, რომელსაც 5-ჯერ შეუცვლით მნიშვნელობას და საბოლოოდ დაბეჭდავთ მის მნიშვნელობას
country=("Spain")
country=("France")
country=("America")
country=("Brazil")
country=("Georgia")
print(country)

#5) თქვენი სიტყვებით ახსენით რას ნიშნავს case-sensitive და case-insensitive```
#case-sensitive ში პატარა და დიდი ასოები განსხვავდება
#case-insesitive ში  დიდი და პატარა ერთნაირად ითვლება
#ესეიგი პირველში თუ მაგალითდ რამე შქმენი და პირველი ასო გაქვს დიდი და შენ დაწერე პატარა ამას დიდი გამსხვავება აქვს და მეორეშ ამას ყურადღებას არ აქცევენ რადგან ორივეს ერთი და იგივედ თვლიან