#2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის(მოიყვანეთ მაგალითით შექმენით ნებისმიერი სია)
fruits = ["Apple","Banana","Mango","Grape"] 

#სია არის ჩამონათვალი

#3) კომენტარებით ახსენით რა არის ინდექსი.
 
#რიცხვი რომელიც მიუთითებს სიაში ადგილმდებარეობას

#4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა

name=["gio","dato","soso","givi","lile","nino","lizi"]
print(name)
name[1] = "sandro"
name[5] = "ilia"

print(name)
#5) უყურეთ დღევანდელ ჩანაწერს