#1) კომენტარებით ახსენით რა არის არგუმენტი, range ფუნქცია და რა ხდება მაშინ, როდესაც მას გადაეცემა ერთი, ორი ან სამი არგუმენტი.

#2) დაითვალეთ რამდენი ლუწი რიცხვია 1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)

#3) დაბეჭდეთ 1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული. გამოიყენეთ for loop-ი.(დაგჭირდებათ ორი ცვლადის შექმნა, ერთში შეინახავთ ჯამს, მეორეში რაოდენობას)

#4) დაბეჭდეთ ყველა რიცხვი 1-დან 30-მდე, რომელიც იყოფა 3-ზე(გამოიყენეთ for loop-ი)

#5) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მიღებული რიცხვის ყველა გამყოფი(გამოიყენეთ for loop-ი)


#6) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დაბეჭდავს ეს რიცხვი დადებითია, უარყოფითია თუ 0-ია
number=int(input("please enter you number: "))
if number>0:
    print("dadebitia")
else:
    print("uaryopitia")

#7) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს წელს და გაიგებს არის თუ არა ის ნაკიანი(წელი როდესაც თებერვალში 29 დღე გვაქვს).
#  ნაკიანი არის წელი თუ ის იყოფა 4-ზე და არ იყოფა 100-ზე ან იყოფა 400-ზე.(გამოიყენეთ and და or ოპერატორები)

year = 2016

if year % 4 == 0 and year % 400 != 0:
    print(True)
else:
    print(False)