#1)განიხილეთ ეს კოდი (რას გამოიტანს):

name = "vano"
age = 0
print(name + "best")

#ეს კოდი გამოიტანს vanobest

#2)კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგიგნი

#კომენტარი არის შენი აზრის გამოტანა და დასატაურებაც ასევვე რაიმე კოდის

#3)რა არის ამ კოდში შეცდომა (რომელ ხაზზე)
# ამ კოდში შეცდომა არის 2 ხაზში და 3 ხაზში 2 ში იმიტომ რომ აკლია ბრჭყალები 3 ში იმიტომ რომ გამოყენებულია space რიცხვებს შორის
#name = "vano"
#surname = motiashvili
#height = 1 86
#print(name + surname - height)
