#2) კომენტარებით ახსენით რა არის for ციკლი, საიტერაციო ცვლადი და range ფუნქცია

#for ციკლი არის ბრძანება რითიც გავამეორებთ ერთი და იგივეს ბევრჯერ საიტერაციო ცვლადი არის for ციკლის ცვლადი და 
#range ფუნქცია ესეც დამხმარეა for ციკლის რითიც ერთი და იგივს ბევრჯერ გავიმეორებთ

#3) დაბეჭდეთ 0-დან 50-ის ჩათვლით ყველა რიცხვი for ციკლის გამოყენებით
for i in range(0, 51):
    print(i)
#4) მომხმარებელს შემოატანინეთ 5 რიცხვი for ციკლის გამოყენებით და დაბეჭდეთ მათი საშუალო არითმეტიკული.
jami1=0

for i in range(5):
    number=int(input("please enter you number: "))
jami=number+jami1

aritmetikuli=jami/5

print(aritmetikuli)

