#2) თქვენი სიტყვებით ახსენით, თუ რა არის დეკლარაცია, ინიციალიზება და რეინიციალიზება.

#დეკლარაცია არის ცვლადის შექმნა

#ინიციალიზება არის ამ ცვლადისთვის მნიშვნელობის მინიჭება 

#ხოლო რეინიციალიზება არის ცვლადისთვის მნისშვნეელობის შეცვლა



#3) შექმენით ცვლადი, შეუცვალეთ მას მნიშვნელობა 3-ჯერ. თითოეული მნიშვნელობის შეცვლის შემდეგ დაბეჭდეთ ეს ცვლადი.

name="luka"
name="nika"
name="dato"

print(name)

#4) შექმენით 5 ცვლადი, სადაც შეინახავთ რიცხვებს. დაბეჭდეთ მათი ჯამი print ფუნქციის გამოყენებით.

number1=9
number2=3
number3=7
number4=5
number5=3

print(number1+number2+number3+number4+number5)


#5) მართკუთხედის პერიმეტრი:
#შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაბეჭდეთ.```

lenght=20

width=10
#მართკუხედის პერიმეტრი ტოლია (20+10)x2

print(width+lenght)
#witth+lenght=30

print(30*2)