#2) კომენტარებით ახსენით თუ რას აკეთებს .upper(); .lower(); .capitalize(); .find() ფუნქციები.

#.upper() ნებისმიერ შემოტანილ სიტყვას გადააქცევს დიდ შრიფტით
#.lower() გადააქცევს პატარა შრიფტით
#.capitalize() პირველ ასოს გადააქცევს დიდ შრიფტად
#.find() ფრიჩხელებში ჩაწერილ ასოს იპოვის და გამოიტანს მერამდენე ინდექსზე დგას

#3) მომხმარებელს შემოატანინეთ წინადადება და დაბეჭდეთ იგი პატარა ასოებით.

name=print((input("please enter name: ").lower()))

#4) მომხმარებელს შემოატანინეთ ელფოსტის მისამართი და გადაამოწმეთ შეიცავს თუ არა '@' სიმბოლოს, შედეგი კი დაბეჭდეთ დიდი ასოებით.

email = input("Enter email")
if '@' in email:
    print("Valid email")
else: 
    print("Invalid email")

#5) მომხმარებელს შემოატანინეთ წიგნის დასახელება და შედეგი დაბეჭდეთ სათაურის სტილში.

name1=print((input("please enter name of book: ").capitalize()))

#6) მომხმარებელს შემოატანინეთ წინადადება და სიმბოლო. თქვენი დავალებაა დაითვალოთ რამდენჯერ გვხვდება ეს სიმბოლო წინადადებაში.

sum=input("please enter word: ")
sum1=input("please enter symbol: ")

sum=print((sum).find(sum1))

#7) მომხმარებელს შემოატანინეთ სიტყვა და შეამოწმეთ, არის თუ არა იგი დიდი ასოებით, თუ კი — დაბეჭდე "სიტყვა უკვე დიდია!", თუ არა — გადააქციე და დაბეჭდე.

word=(input("please enter word: "))
if word.isupper():
    print("The word is upper case")
else:
    print(word.upper())