#1) ახსენით რა არის HTML და რისთვის გამოიყენება ის.
#HTML არის ენა რომლითაც შეგიძლია შექმნა საიტი 

#2) ვისაც ჯერ არ გადმოგიწერიათ და არ გაგიტესტავთ live server extension'ი, აუცილებლად გამდმოწერეთ და გატესტეთ, თუ რამე კითხვა გექნებათ დაიხმარეთ რაზმის ლიდერები
#გადმოვიწერე და გავტესტე 


#3) შექმენით html'ის ფაილი და შიგნით შექმენით 3 paragraph'ი, სხვადასხვა ტექსტებით
#შევქმენი

#4) შექმენით html'ის ფაილი და შიგნით ჩასვით 3 button'ი
#შევქმენი

#5) მოიძიეთ სხვა თეგებზე ინფორმაცია და შექმენით მარტივი საიტი თქვენს თავზე```
#მე მოვიძიე <div> თაგზე რომელიც ცოტა რთული იყო გასაკეთებლად ის არის background colori კიდე მოვიძე <hr> რომელიც გამყოფი ხაზია ტექსტებს შორის
#



