#2) უყურეთ შემდეგ ვიდეოს და კომენტარებით ახსენით რა არის binary code.

#3) შექმენით რეგისტრაცია/ავტორიზაციის სიმულაცია:
#მომხმარებელს შემოატანინეთ ემაილი, პაროლი და შეინახეთ ისინი ცვლადებში. ისევ შემოატანინეთ ემაილი და პაროლი(ეს იქნება ავტორიზაცია)
#და თუ შემოტანილი მნიშვნელობები დაემთხვევა რეგისტრაციისას შეყვანლის, დაბეჭდეთ True, სხვა შემთხვევაში False.

input("please")

#4) კომენტარებით ახსენით რა არის ლოგიკური ოპერატორები და გააკეთეთ თითოეულ ოპერატორზე 4-4 მაგალითი
#იგი გამოიყენება სიმართლის ან ტყუილის გამოსატანად ის საზღვრავს რაიმე მოქმედებას სიმართლეა თუ არა

#5) გადახედეთ შემდეგ რესურსს:
