#2) უყურეთ შემდეგ ვიდეოს და კომენტარებით ახსენით რა არის binary code.
#BINARY არის 1 და 0 ანებით წერა მისი სწავლა ძალიან ძნელია და მათით იმართება პითონი და ის ძველ პროგრამირებაში გამოიყენებოდა

#3) შექმენით რეგისტრაცია/ავტორიზაციის სიმულაცია:
#მომხმარებელს შემოატანინეთ ემაილი, პაროლი და შეინახეთ ისინი ცვლადებში. ისევ შემოატანინეთ ემაილი და პაროლი(ეს იქნება ავტორიზაცია)
#და თუ შემოტანილი მნიშვნელობები დაემთხვევა რეგისტრაციისას შეყვანლის, დაბეჭდეთ True, სხვა შემთხვევაში False.

email=input("please enter you email: ")
pasword=input("please creat new pasword: ")

email1=input("please enter you email again: ")
pasword1=input("please enteer you pasword: ")

print(email==email1)
print(pasword==pasword1)
#4) კომენტარებით ახსენით რა არის ლოგიკური ოპერატორები და გააკეთეთ თითოეულ ოპერატორზე 4-4 მაგალითი
#იგი გამოიყენება სიმართლის ან ტყუილის გასარკვევად ის საზღვრავს რაიმე მოქმედებას სიმართლეა თუ არა, ლოგიკური ოპერატორებია end, or

print(5 > 3 and 2 < 4) #True
print(5 < 3 and 2 < 4) #False
print(5 < 3 and 2 > 4) #False
print(10 == 10 and 7 >= 5) #True

print(5 > 3 or 2 > 4) #True
print(5 < 3 or 2 < 4) #False
print(5 == 5 or 10 < 20) #True
print(7 < 10 or 2 > 4) #True

#5) გადახედეთ შემდეგ რესურსს:
#გადავხედე