#1) შექმენით 5 ელემენტიანი სია. გადაუარეთ მას for ციკლით და დაბეჭდეთ მისი თითოეული ელემენტი

names=[1, 2, 3, 4, 5, ]
for i in names:
    print(i)

#2) შექმენით ცვლადი სადაც შეინახავთ ნებისმიერ წინადადებას. გადაუარეთ for ციკლით მას და დაბეჭდეთ წინადადების თითოეული სიმბოლო

something="alte"
for i in something:
    print(i)
#3) პირველ დავალებაში შექმნილ სიას გადაუარეთ while ციკლის გამოყენებით.(მინიშნება: დაგჭირდებათ ცვლადის შექმნა, რომელსაც გაზრდით ყოველი იტერაციისას და
#გამოიყენებთ სიის ინდექსებზე წვდომის მისაღებად)
#(edited)

index=0
while index<len(names):
    print(names[index])
    index+=1  