#1) თქვენი სიტყვებით ახსენით რა არის string და integer. მოიყვანეთ მაგალითები.

#string გამოიყნება ტექსტურ ტიპებთან ხოლო integer მთლ რიცხვებთნ და კიდევ თუ მთლი რიცხვი ფრჩხილებშია ესეც კი string იქნეება ფრჩხილეების გამო

name=("dato")
age=(14)

print(type(name))
print(type(age))


#2) შექმენით 3 ცვლადი სადაც შეინახავთ თქვენთვის სასურველ მონაცემს. type ფუნქციის გამოყენებით დაბეჭდეთ მათი ტიპი.
cuntry=("gorgia")
mosaxleoba=(3000000)
city=("axalcixe")

print(type(cuntry))
print(type(mosaxleoba))
print(type(city))



#3) ახსენით რა არის კონკადინაცია(თუ არ იცით, მოიძიეთ) და მოიყვანეთ მისი მაგალითი.

#კონკადინაცია არის 2 ან მეტი ტექსტის გაეერტიანება ერთში

print("helo "+ "dato")




#4) რომელია სწორი და რატომ:
#print("Hello World!')
#print('Hello' World!')
print("Hello World") #არის სწორი

#არის სწორი იმიტომ რომ დასაწყისშიც და დასასრულშიც გამოიყენება ერთი და იგივე ბრჭყალი არ აქვს მნისშვნელობა ეს , არის თუ ეს"



#5) შექმენით 3 ცვლადი, თითოეულში შეინახეთ სასურველი რიცხვი. შემდეგ შექმენით ახალი ცვლადი, სადაც შეინახეთ ამ 3 რიცხვის საშუალო არითმეტიკულს და დაბეჭდეთ ის.```

age=(14)
year=(2025)
number=(3)

aritmetikuli=(age+year+number)
print(aritmetikuli)
print(aritmetikuli/3)

